app/controllers/store_controller.rb

SELECT * FROM `products` ORDER BY title
---
  def index
	@products = Product.find_product_for_sale

SELECT * FROM `products` WHERE (`products`.`id` = 12)
---
def add_to_cart
    product = Product.find(params[:id])